Функция ВыполнитьАнализ(Содержимое) Экспорт
	
	Если СтрНайти(Содержимое,"Процедура")>0 Тогда
		Содержимое = СтрЗаменить(Содержимое,"Процедура","fn")+"{";
		Массив = СтрРазделить(Содержимое,"(,)",Ложь);
		Если Массив.Количество() = 2 Тогда
			Возврат Массив[0]+"()"+Массив[1];
		Иначе
			Параметры = "";
			Для сч =1 по Массив.Количество()-2 Цикл
				Параметры = Параметры + Массив[сч]+":T,";
			КонецЦикла;
			Возврат Массив[0]+"<T>("+Лев(Параметры,СтрДлина(Параметры)-1)+")"+Массив[Массив.ВГраница()];
		КонецЕсли;
	ИначеЕсли СтрНайти(Содержимое,"КонецПроцедуры")>0 Тогда
		Возврат СтрЗаменить(Содержимое,"КонецПроцедуры","}");
	Иначе
		Возврат Содержимое;
	КонецЕсли;
	
КонецФункции