Функция ВыполнитьАнализ(Содержимое,СтруктураПроцедур) Экспорт
	
	Если СтрНайти(Содержимое,"Процедура")>0 Тогда
		Содержимое = СтрЗаменить(Содержимое,"Процедура","fn")+"{";
		Содержимое = СтрЗаменить(Содержимое,"ПриНачалеРаботыСистемы()","ПриНачалеРаботыСистемы(ПараметрЗапуска)");
		Массив = СтрРазделить(Содержимое,"(,)",Ложь);
		СтруктураПроцедур.Добавить(Новый Структура());
		Если Массив.Количество() = 2 Тогда
			Возврат Массив[0]+"()"+Массив[1];
		Иначе
			Параметры = "";
			Для сч =1 по Массив.Количество()-2 Цикл
				Параметры = Параметры + Массив[сч]+":T,";
			КонецЦикла;
			Возврат Массив[0]+"<T>("+Лев(Параметры,СтрДлина(Параметры)-1)+")"+Массив[Массив.ВГраница()];
		КонецЕсли;
	ИначеЕсли СтрНайти(Содержимое,"КонецПроцедуры")>0 Тогда
		Возврат СтрЗаменить(Содержимое,"КонецПроцедуры","}");
	Иначе
		Если СтрНайти(Содержимое,"""")>0 Тогда
			Массив = СтрРазделить(Содержимое,"""");
			Содержимое = "";
			Для сч = 0 По Массив.Количество()-1 Цикл
				Если сч % 2 = 0 Тогда
					Содержимое = Содержимое + Массив[сч]+ """";
				Иначе
					Содержимое = Содержимое + СтрСоединить(СтрРазделить(Массив[сч],"\"),"\\") + """";
				КонецЕсли;
			КонецЦикла;
			Содержимое= Лев(Содержимое,СтрДлина(Содержимое)-1);
		КонецЕсли;
		Если СтрНайти(Содержимое,"Если")=0
			И СтрНайти(Содержимое,"ИначеЕсли")=0
			И СтрНайти(Содержимое,"=")>0 Тогда
			Массив = СтрРазделить(Содержимое,"=");
			Если СтруктураПроцедур[СтруктураПроцедур.ВГраница()].Свойство(СокрЛП(Массив[0])) = Ложь Тогда
				СтруктураПроцедур[СтруктураПроцедур.ВГраница()].Вставить(СокрЛП(Массив[0]));
				Массив[0] = СтрЗаменить(Массив[0],СокрЛП(Массив[0]),"let " +СокрЛП(Массив[0]));
				Содержимое = СтрСоединить(Массив,"=");
			КонецЕсли;
		КонецЕсли;
		
		Содержимое = СтрЗаменить(Содержимое," Не "," !");
		Содержимое = СтрЗаменить(Содержимое,"Тогда","{");
		Содержимое = СтрЗаменить(Содержимое,"ИначеЕсли","} else if");
		Содержимое = СтрЗаменить(Содержимое,"КонецЕсли;","}");
		Содержимое = СтрЗаменить(Содержимое,"Иначе","} else {");
		Содержимое = СтрЗаменить(Содержимое,"Если","if");
			
		Возврат Содержимое;
	КонецЕсли;
	
КонецФункции